// คู่สามของพิธากอรัส
// สามเหลี่ยมมุมฉากที่มีด้านประกอบมุมฉากยาว a และ b และมีด้านตรงข้ามมุมฉากยาว c จะมีความสัมพันธ์ตามทฤษฎีของพิธากอรัสคือ 

//  คู่สามของพิธากอรัสก็คือค่า ( a, b, c ) นี่เอง จงเขียนโปรแกรมรับค่า n และตรวจสอบดูว่ามีคู่สามของพิธากอรัสใดที่ n = a+b+c หรือไม่ กำหนดให้ n, a, b, และ c เป็นเลขจำนวนเต็มเท่านั้น และ a < b < c

// ตัวอย่างเช่นเมื่อ n = 12 คู่สามของพิธากอรัสก็คือ (3, 4, 5) หรือเมื่อ n = 30 คู่สามของพิธากอรัสก็จะเป็น (5, 12, 13) เป็นต้น 
// ถ้าค่า n นั้นไม่สามารถหาคู่สามของพิธากอรัสได้ให้พิมพ์คำว่า No triple found.

// หมายเหตุ: ค่า n หนึ่งค่าอาจมีคู่สามของพิธากอรัสมากกว่าหนึ่งชุด แต่ในการตรวจนั้นจะใช้เฉพาะค่า n ซึ่งทำให้มีคู่สามของพิธากอรัสอย่างมากที่สุดแค่คู่เดียว จึงไม่ต้องกังวลในประเด็นนี้ในการทำโจทย์ข้อนี้นี้

// ตัวอย่างผลลัพธ์ 1
// 12
// (3, 4, 5)
// ตัวอย่างผลลัพธ์ 2
// 20
// No triple found.

#include <stdio.h>
#include <stdlib.h>

int main(){
    int n, i = 3 , j = 4, c = 1;
    scanf("%d", &n);
    
    while (i * j <= n){
    if(i % 2 != 0){
        printf("i_odd = %d\n",i);
        printf("c_odd = %d\n",c);
        if (i * j == n)
            break;
        i += 1;
        j += 2;
        c += 1;
    }
    else{
        printf("i = %d\n",i);
        printf("c = %d\n",c);
        if(i * (c + 2) == n)
            break;
        i += 1;
    }
    }

    if (i * j == n){
    printf("(%d, %d, %d)", i, j * c, j * c + 1);
    }
    else if (i * (j * i) == n){
    printf("(%d, %d, %d)", i, j * c, j * c + 1);
    }
    else {
    printf("No triple found.");
    }

}