//เขียนประโยคคำสั่งเพื่อทำการจองพื้นที่หน่วยความจำ ที่ทำการเก็บตัวแปรชนิด int ขนาด 20 integers โดยหน่วยความจำดังกล่าวถูกชี้โดย pointer A

//Ans1  = "A=(int*)malloc(20*sizeof(int))";

//เขียนประโยคคำสั่งเพื่อทำการจองพื้นที่หน่วยความจำ ที่ทำการเก็บตัวแปรชนิด int ขนาด 40 byte โดยกำหนดให้ค่าเป็น 0 ของหน่วยความจำที่ชี้โดย pointer B

//Ans2  = "B=(int*)calloc(10,sizeof(int))";

//ให้ทำการลดพื้นที่การจองในข้อ 1 เป็น 10 intergers

//Ans3  = "A=(int*)realloc(A,10*sizeof(int))";

//ให้ทำการเพิ่มพื้นที่การจองในข้อ 2 เป็น 15 intergers

//Ans4  = "B=(int*)realloc(B,15*sizeof(int))";